<a href="https://colab.research.google.com/github/Satyamaadi/python/blob/master/Data_wrangling_using_numpy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv')

In [3]:
df.head()

                                            Name PClass  ...  Survived SexCode
0                   Allen, Miss Elisabeth Walton    1st  ...         1       1
1                    Allison, Miss Helen Loraine    1st  ...         0       1
2            Allison, Mr Hudson Joshua Creighton    1st  ...         0       0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  ...         0       1
4                  Allison, Master Hudson Trevor    1st  ...         1       0

[5 rows x 6 columns]

##Creating a pandas dataframe

In [5]:
data_frame = pd.DataFrame() #empty data frame

In [6]:
data_frame['name'] = ['Shikhar','Aditya']
data_frame['subject'] = ['Computers','Algorithms']

In [7]:
data_frame

      name     subject
0  Shikhar   Computers
1   Aditya  Algorithms

##Describing the dataframe

In [8]:
data_frame.head() #one way to describe

      name     subject
0  Shikhar   Computers
1   Aditya  Algorithms

In [9]:
data_frame.shape #for realizing the shape of data frame

(2, 2)

In [10]:
data_frame.describe()

           name    subject
count         2          2
unique        2          2
top     Shikhar  Computers
freq          1          1

##Selecting rows from data frame

In [14]:
data_frame.iloc[0] #selects first row(s) from dataframe

name         Shikhar
subject    Computers
Name: 0, dtype: object

In [15]:
#data frames can be indexed using any unique values unlike dbms we can use any column that has unique values.

In [16]:
data_frame = data_frame.set_index(data_frame['name'])

In [17]:
data_frame

            name     subject
name
Shikhar  Shikhar   Computers
Aditya    Aditya  Algorithms

In [18]:
#selecting rows on some conditions

In [20]:
data_frame[data_frame['subject'] == 'Algorithms'].describe()

          name     subject
count        1           1
unique       1           1
top     Aditya  Algorithms
freq         1           1

In [23]:
data_frame = data_frame['subject'].replace('Algorithms','Data Structure')

In [25]:
data_frame

name
Shikhar         Computers
Aditya     Data Structure
Name: subject, dtype: object

In [30]:
#renaming a column
data_frame = data_frame.rename({'name':'Full Name'})

In [31]:
data_frame

name
Shikhar         Computers
Aditya     Data Structure
Name: subject, dtype: object

In [32]:
#we can use df.max(),df.min(),df.sum(),df.mean(),df.count() for all the respective functionlities

In [33]:
#for getting unique values of a column in data frame we use df.unique() ,df.value_counts() for the functionality as thy name suggests

##Handling null values

In [35]:
df[df['Age'].isnull()]

                              Name PClass  Age     Sex  Survived  SexCode
12    Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13        Barkworth, Mr Algernon H    1st  NaN    male         1        0
14              Baumann, Mr John D    1st  NaN    male         0        0
29         Borebank, Mr John James    1st  NaN    male         0        0
32              Bradley, Mr George    1st  NaN    male         1        0
...                            ...    ...  ...     ...       ...      ...
1300         Wiseman, Mr Phillippe    3rd  NaN    male         0        0
1302             Yalsevac, Mr Ivan    3rd  NaN    male         1        0
1305            Youssef, Mr Gerios    3rd  NaN    male         0        0
1306           Zabour, Miss Hileni    3rd  NaN  female         0        1
1307           Zabour, Miss Tamini    3rd  NaN  female         0        1

[557 rows x 6 columns]

In [36]:
#where NaN stands for Not a Number(numpys' [np.nan])

In [37]:
#deleting a column
data_frame['Column_to_delete'] = []

In [40]:
print(data_frame.head())

name
Shikhar                  Computers
Aditya              Data Structure
Column_to_delete                []
Name: subject, dtype: object

In [43]:
data_frame.drop('Column_to_delete',axis=0)

name
Shikhar         Computers
Aditya     Data Structure
Name: subject, dtype: object

In [44]:
#use apply() to apply a function to all rows